Catalogs/КорпоративныеБанковскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КорпоративныеБанковскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорпоративнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусаБанковскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КорпоративныеБанковскиеКарты/Ext/ObjectModule.bsl
Функция ЕстьДубльКарты()
	
	Если СокрЛП(ЭтотОбъект.НомерКорпоративнойКарты) = "" Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийЭлемент"	, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Номер"			, ЭтотОбъект.НомерКорпоративнойКарты);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрКарты.Ссылка
	|ИЗ
	|	Справочник.КорпоративныеБанковскиеКарты КАК СпрКарты
	|ГДЕ
	|	СпрКарты.НомерКорпоративнойКарты = &Номер
	|	И НЕ СпрКарты.Ссылка = &ТекущийЭлемент
	|	И НЕ СпрКарты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции


Процедура ПередЗаписью(Отказ)
	
	Если ЕстьДубльКарты() Тогда
		Сообщить("Данный номер корпоративной карты (" + ЭтотОбъект.НомерКорпоративнойКарты + ") уже используется!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекНаименование = СокрЛП(ЭтотОбъект.ФизЛицо.Наименование) + " " + ЭтотОбъект.НомерКорпоративнойКарты;
	Если НЕ ЭтотОбъект.Наименование = ТекНаименование Тогда
		ЭтотОбъект.Наименование = ТекНаименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтотОбъект.ФизЛицо.НомерКорпоративнойКарты = ЭтотОбъект.Ссылка Тогда
		//ЭтотОбъект.ФизЛицо.НомерКорпоративнойКарты = ЭтотОбъект.Ссылка; 
		ОбъектСправочника = ЭтотОбъект.ФизЛицо.ПолучитьОбъект();
		ОбъектСправочника.НомерКорпоративнойКарты = ЭтотОбъект.Ссылка;
		Попытка
			ОбъектСправочника.Записать();;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
